Aero123421/ESP32C3Meshtest/src/espnow_mesh.cpp
#include "espnow_mesh.h"
#include "mesh_validation.h"

#include <Arduino.h>
#include <WiFi.h>
#include <esp_system.h>
#include <esp_wifi.h>

#include <cstdlib>
#include <cstring>

namespace lpwa {

namespace {
constexpr uint8_t kBroadcastMac[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
constexpr uint32_t kParseRejectDuplicateWindowMs = 250;
#if LPWA_ENABLE_WIFI_LR && (!LPWA_ENABLE_BLE_RELAY || LPWA_ALLOW_WIFI_LR_WITH_BLE) && defined(WIFI_PROTOCOL_LR)
constexpr bool kLongRangeProfileAvailable = true;
#else
constexpr bool kLongRangeProfileAvailable = false;
#endif

uint16_t randomDelayMs(uint16_t minMs, uint16_t maxMs) {
  if (maxMs < minMs) {
    return minMs;
  }
  if (maxMs == minMs) {
    return minMs;
  }
  const uint32_t span = static_cast<uint32_t>(maxMs - minMs) + 1U;
  const uint32_t r = esp_random() % span;
  return static_cast<uint16_t>(static_cast<uint32_t>(minMs) + r);
}
}

EspNowMesh* EspNowMesh::instance_ = nullptr;

EspNowMesh::EspNowMesh() {
  std::memset(nodes_, 0, sizeof(nodes_));
  std::memset(neighbors_, 0, sizeof(neighbors_));
  std::memset(routes_, 0, sizeof(routes_));
  std::memset(inboundQueue_, 0, sizeof(inboundQueue_));
}

bool EspNowMesh::begin() {
  if (instance_ != nullptr && instance_ != this) {
    return false;
  }
  instance_ = this;
  ready_ = false;
  txAwaiting_ = false;

  const uint64_t efuseMac = ESP.getEfuseMac();
  nodeId_ = static_cast<uint32_t>((efuseMac >> 24) ^ (efuseMac & 0x00FFFFFFULL));
  if (nodeId_ == 0) {
    nodeId_ = 1;
  }

  nextMessageId_ = esp_random();
  if (nextMessageId_ == 0) {
    nextMessageId_ = 1;
  }
  stats_ = MeshStats{};
  duplicateFilter_.clear();
  parseRejectFilter_.clear();
  nodeCount_ = 0;
  std::memset(neighbors_, 0, sizeof(neighbors_));
  std::memset(routes_, 0, sizeof(routes_));
  inboundHead_ = 0;
  inboundTail_ = 0;
  inboundCount_ = 0;

  if (rxQueue_ == nullptr) {
    rxQueue_ = xQueueCreate(kRxQueueDepth, sizeof(RxQueueItem));
  } else {
    xQueueReset(rxQueue_);
  }
  if (rxQueue_ == nullptr) {
    return false;
  }
  if (txResultQueue_ == nullptr) {
    txResultQueue_ = xQueueCreate(kRxQueueDepth, sizeof(TxResultItem));
  } else {
    xQueueReset(txResultQueue_);
  }
  if (txResultQueue_ == nullptr) {
    return false;
  }

#if defined(ARDUINO_XIAO_ESP32C6)
  // XIAO C6 RF switch: GPIO3 enables software selection and GPIO14 selects
  // onboard (LOW) versus external U.FL (HIGH). Default to onboard.
  pinMode(3, OUTPUT);
  digitalWrite(3, LOW);
  delay(100);
  pinMode(14, OUTPUT);
#if LPWA_XIAO_C6_EXTERNAL_ANTENNA
  digitalWrite(14, HIGH);
#else
  digitalWrite(14, LOW);
#endif
#endif

  WiFi.persistent(false);
  WiFi.setAutoReconnect(false);
  if (!WiFi.mode(WIFI_STA)) return false;
  WiFi.disconnect();
  delay(20);

  // Best-effort tuning: if a platform build does not support one of these knobs,
  // continue with defaults instead of failing mesh startup.
  if (esp_wifi_set_country_code("JP", false) != ESP_OK) return false;
  if (esp_wifi_set_bandwidth(WIFI_IF_STA, WIFI_BW_HT20) != ESP_OK) return false;

  hasStaMac_ = false;
  std::memset(staMac_, 0, sizeof(staMac_));
  if (esp_wifi_get_mac(WIFI_IF_STA, staMac_) == ESP_OK) {
    hasStaMac_ = true;
  }

  const esp_err_t channelResult = esp_wifi_set_channel(kMeshChannel, WIFI_SECOND_CHAN_NONE);
  if (channelResult != ESP_OK) {
    return false;
  }

  radioProfile_ = kWifiLongRangeDefault ? RadioProfile::LongRange : RadioProfile::Balanced;
  nodeInfoTtl_ = kDefaultNodeInfoTtl;
  nodeInfoPeriodMs_ = kNodeInfoPeriodMs;

  const esp_err_t initResult = esp_now_init();
  if (initResult != ESP_OK && initResult != ESP_ERR_ESPNOW_EXIST) {
    return false;
  }

  if (esp_now_register_send_cb(EspNowMesh::onSendStatic) != ESP_OK ||
      esp_now_register_recv_cb(EspNowMesh::onRecvStatic) != ESP_OK) return false;

  esp_now_peer_info_t peerInfo{};
  std::memcpy(peerInfo.peer_addr, kBroadcastMac, sizeof(kBroadcastMac));
  peerInfo.channel = kMeshChannel;
  peerInfo.encrypt = false;
  peerInfo.ifidx = WIFI_IF_STA;

  const esp_err_t peerResult = esp_now_add_peer(&peerInfo);
  if (peerResult != ESP_OK && peerResult != ESP_ERR_ESPNOW_EXIST) {
    return false;
  }

  // Apply profile after ESP-NOW init/peer setup because some Wi-Fi state can
  // be reset during bring-up; this keeps LR/BT coexist settings effective.
  if (!applyRadioProfile(radioProfile_)) {
    return false;
  }

  NodeRecord* selfNode = nullptr;
  upsertNode(nodeId_, &selfNode);
  if (selfNode != nullptr) {
    selfNode->lastSeenMs = millis();
    selfNode->lastRssi = 0;
    selfNode->hasMac = hasStaMac_;
    if (hasStaMac_) {
      std::memcpy(selfNode->staMac, staMac_, sizeof(staMac_));
    }
    selfNode->uptimeSec = 0;
    selfNode->freeHeap = ESP.getFreeHeap();
  }

  const uint32_t nowMs = millis();
  const uint32_t firstDelay = randomDelayMs(kNodeInfoInitialJitterMinMs, kNodeInfoInitialJitterMaxMs);
  nextNodeInfoDueMs_ = nowMs + firstDelay;
  ready_ = true;
  return true;
}

void EspNowMesh::loop() {
  if (!ready_) return;
  processTxResultQueue();
  // A missing callback must never be attributed to a later frame. Quarantine
  // sends and restart the radio/MCU only after a prolonged driver stall.
  if (txAwaiting_ && (millis() - txStartedMs_) > 10000U) {
    Serial.println("{\"type\":\"error\",\"code\":\"tx_callback_stalled\",\"detail\":\"restarting radio\"}");
    delay(20);
    ESP.restart();
    return;
  }
  pruneRoutingTables(millis());
  processRxQueue();

  uint32_t droppedByTimeout = 0;
  reassembly_.PruneExpired(millis(), kReassemblyTimeoutMs, &droppedByTimeout);
  stats_.reassemblyTimeouts += droppedByTimeout;

  const uint32_t nowMs = millis();
  if (static_cast<int32_t>(nowMs - nextNodeInfoDueMs_) >= 0) {
    sendNodeInfo(nodeInfoTtl_);
    const uint32_t jitterMs = randomDelayMs(0, kNodeInfoJitterMaxMs);
    nextNodeInfoDueMs_ = nowMs + nodeInfoPeriodMs_ + jitterMs;
  }
}

bool EspNowMesh::sendText(const char* text, uint8_t ttl, uint32_t* outMessageId) {
  if (text == nullptr) {
    return false;
  }
  const size_t len = std::strlen(text);
  return sendPayload(AppPayloadType::Text, reinterpret_cast<const uint8_t*>(text), len, ttl,
                     outMessageId);
}

bool EspNowMesh::sendBinary(const uint8_t* payload, size_t len, uint8_t ttl, uint32_t* outMessageId) {
  if (len > 0 && payload == nullptr) {
    return false;
  }
  return sendPayload(AppPayloadType::Binary, payload, len, ttl, outMessageId);
}

bool EspNowMesh::sendTextDirected(const char* text, uint32_t dstNodeId, uint8_t ttl, uint32_t* outMessageId) {
  if (text == nullptr) {
    return false;
  }
  const size_t len = std::strlen(text);
  return sendPayloadDirected(AppPayloadType::Text, reinterpret_cast<const uint8_t*>(text), len, dstNodeId,
                             ttl, outMessageId);
}

bool EspNowMesh::sendBinaryDirected(const uint8_t* payload, size_t len, uint32_t dstNodeId, uint8_t ttl,
                                    uint32_t* outMessageId) {
  if (len > 0 && payload == nullptr) {
    return false;
  }
  return sendPayloadDirected(AppPayloadType::Binary, payload, len, dstNodeId, ttl, outMessageId);
}

