Aero123421/ESP32C3Meshtest/src/espnow_mesh.cpp
bool EspNowMesh::popReceivedMessage(ReassembledMessage* outMessage) {
  if (outMessage == nullptr || inboundCount_ == 0) {
    return false;
  }

  *outMessage = inboundQueue_[inboundHead_];
  inboundHead_ = (inboundHead_ + 1) % kInboundMessageQueueDepth;
  inboundCount_--;
  return true;
}

void EspNowMesh::getStats(MeshStats* outStats) const {
  if (outStats == nullptr) {
    return;
  }
  *outStats = stats_;
  outStats->rxQueueDropped += callbackRxDrops_.load();
  outStats->txResultQueueDropped += callbackTxDrops_.load();
}

size_t EspNowMesh::copyNodeRecords(NodeRecord* outRecords, size_t maxRecords) const {
  if (outRecords == nullptr || maxRecords == 0) {
    return 0;
  }
  const size_t count = (nodeCount_ < maxRecords) ? nodeCount_ : maxRecords;
  for (size_t i = 0; i < count; ++i) {
    outRecords[i] = nodes_[i];
  }
  return count;
}

size_t EspNowMesh::copyRouteRecords(RouteRecord* outRecords, size_t maxRecords) const {
  if (outRecords == nullptr || maxRecords == 0) {
    return 0;
  }
  size_t count = 0;
  const uint32_t nowMs = millis();
  for (size_t i = 0; i < kMaxRouteEntries && count < maxRecords; ++i) {
    const RouteEntry& route = routes_[i];
    if (!route.used || route.dstNodeId == 0) {
      continue;
    }
    if (isRouteLegValid(route.nextHopMac, route.learnedMs, nowMs)) {
      RouteRecord rec{};
      rec.dstNodeId = route.dstNodeId;
      rec.nextHopNodeId = route.nextHopNodeId;
      rec.learnedMs = route.learnedMs;
      rec.hops = route.hops;
      rec.rank = 0;
      rec.metricQ8 = route.metricQ8;
      rec.hasNextHopMac = true;
      std::memcpy(rec.nextHopMac, route.nextHopMac, sizeof(rec.nextHopMac));
      outRecords[count++] = rec;
    }
    if (count >= maxRecords) {
      break;
    }
    if (isRouteLegValid(route.backupNextHopMac, route.backupLearnedMs, nowMs)) {
      RouteRecord rec{};
      rec.dstNodeId = route.dstNodeId;
      rec.nextHopNodeId = route.backupNextHopNodeId;
      rec.learnedMs = route.backupLearnedMs;
      rec.hops = route.backupHops;
      rec.rank = 1;
      rec.metricQ8 = route.backupMetricQ8;
      rec.hasNextHopMac = true;
      std::memcpy(rec.nextHopMac, route.backupNextHopMac, sizeof(rec.nextHopMac));
      outRecords[count++] = rec;
    }
  }
  return count;
}

bool EspNowMesh::resolveNodeIdByMac(const uint8_t* mac, uint32_t* outNodeId) const {
  if (outNodeId != nullptr) {
    *outNodeId = 0;
  }
  if (mac == nullptr) {
    return false;
  }
  for (size_t i = 0; i < nodeCount_; ++i) {
    const NodeRecord& node = nodes_[i];
    if (!node.hasMac) {
      continue;
    }
    if (std::memcmp(node.staMac, mac, 6) == 0) {
      if (outNodeId != nullptr) {
        *outNodeId = node.nodeId;
      }
      return true;
    }
  }
  return false;
}

bool EspNowMesh::setRadioProfile(RadioProfile profile) {
  if (profile == RadioProfile::LongRange && !kLongRangeProfileAvailable) {
    return false;
  }
  if (txAwaiting_ || !ready_) return false;
  if (!applyRadioProfile(profile)) {
    (void)applyRadioProfile(radioProfile_);
    return false;
  }
  radioProfile_ = profile;
  return true;
}

void EspNowMesh::setNodeInfoConfig(uint8_t ttl, uint32_t periodMs) {
  nodeInfoTtl_ = clampTtl(ttl);
  nodeInfoPeriodMs_ = clampNodeInfoPeriodMs(periodMs);
  const uint32_t nowMs = millis();
  if (nextNodeInfoDueMs_ == 0 || static_cast<int32_t>(nextNodeInfoDueMs_ - nowMs) > static_cast<int32_t>(nodeInfoPeriodMs_)) {
    nextNodeInfoDueMs_ = nowMs + randomDelayMs(0, kNodeInfoJitterMaxMs);
  }
}

bool EspNowMesh::parseRadioProfileText(const char* text, RadioProfile* outProfile) {
  if (outProfile != nullptr) {
    *outProfile = RadioProfile::Balanced;
  }
  if (text == nullptr || text[0] == '\0') {
    return false;
  }
  if (std::strcmp(text, "balanced") == 0 || std::strcmp(text, "normal") == 0) {
    if (outProfile != nullptr) {
      *outProfile = RadioProfile::Balanced;
    }
    return true;
  }
  if (std::strcmp(text, "long_range") == 0 || std::strcmp(text, "lr") == 0) {
    if (outProfile != nullptr) {
      *outProfile = RadioProfile::LongRange;
    }
    return true;
  }
  if (std::strcmp(text, "coexist") == 0 || std::strcmp(text, "ble") == 0) {
    if (outProfile != nullptr) {
      *outProfile = RadioProfile::Coexist;
    }
    return true;
  }
  return false;
}



#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 5, 0)
void EspNowMesh::onSendStatic(const esp_now_send_info_t* tx_info, esp_now_send_status_t status) {
  if (instance_ != nullptr) {
    instance_->onSend(tx_info != nullptr ? tx_info->des_addr : nullptr, status);
  }
}
#else
void EspNowMesh::onSendStatic(const uint8_t* mac_addr, esp_now_send_status_t status) {
  if (instance_ != nullptr) {
    instance_->onSend(mac_addr, status);
  }
}
#endif

#if ESP_ARDUINO_VERSION_MAJOR >= 3
void EspNowMesh::onRecvStatic(const esp_now_recv_info_t* info, const uint8_t* data, int len) {
  if (instance_ == nullptr) {
    return;
  }

  const uint8_t* src = nullptr;
  int8_t rssi = 0;
  if (info != nullptr) {
    src = info->src_addr;
    if (info->rx_ctrl != nullptr) {
      rssi = info->rx_ctrl->rssi;
    }
  }
  instance_->onRecv(src, rssi, data, static_cast<size_t>(len));
}
#else
void EspNowMesh::onRecvStatic(const uint8_t* mac_addr, const uint8_t* data, int len) {
  if (instance_ == nullptr) {
    return;
  }
  instance_->onRecv(mac_addr, 0, data, static_cast<size_t>(len));
}
#endif

void EspNowMesh::onSend(const uint8_t* mac_addr, esp_now_send_status_t status) {
  if (!enqueueTxResult(mac_addr, status == ESP_NOW_SEND_SUCCESS)) {
    callbackTxDrops_.fetch_add(1);
  }
}

void EspNowMesh::onRecv(const uint8_t* mac_addr, int8_t rssi, const uint8_t* data, size_t len) {
  if (!enqueueRx(mac_addr, rssi, data, len)) {
    callbackRxDrops_.fetch_add(1);
  }
}

bool EspNowMesh::enqueueRx(const uint8_t* mac_addr, int8_t rssi, const uint8_t* data, size_t len) {
  if (rxQueue_ == nullptr || data == nullptr || len == 0 || len > kEspNowMaxPayload) {
    return false;
  }

  RxQueueItem item{};
  if (mac_addr != nullptr) {
    std::memcpy(item.senderMac, mac_addr, sizeof(item.senderMac));
  } else {
    std::memset(item.senderMac, 0, sizeof(item.senderMac));
  }
  item.rssi = rssi;
  item.len = static_cast<uint16_t>(len);
  std::memcpy(item.data, data, len);

  return xQueueSend(rxQueue_, &item, 0) == pdTRUE;
}

bool EspNowMesh::enqueueTxResult(const uint8_t* mac_addr, bool success) {
  if (txResultQueue_ == nullptr) {
    return false;
  }
  TxResultItem item{};
  item.success = success;
  item.hasMac = (mac_addr != nullptr) && (std::memcmp(mac_addr, kBroadcastMac, 6) != 0);
  if (item.hasMac) {
    std::memcpy(item.mac, mac_addr, sizeof(item.mac));
  } else {
    std::memset(item.mac, 0, sizeof(item.mac));
  }
  return xQueueSend(txResultQueue_, &item, 0) == pdTRUE;
}

