Aero123421/ESP32C3Meshtest/src/espnow_mesh.cpp
void EspNowMesh::recordTxResult(const TxResultItem& item) {
  txAwaiting_ = false;
  if (item.success) ++stats_.txSuccess; else ++stats_.txFailed;
  if (!item.hasMac) return;  // broadcast TX completion is NOT receiver delivery
  NeighborEntry* neighbor = findNeighbor(item.mac);
  if (neighbor == nullptr) return;
  updateNeighborTxEtx(neighbor, item.success);
  neighbor->consecutiveTxFailures = item.success ? 0 :
      static_cast<uint8_t>(neighbor->consecutiveTxFailures < 255 ? neighbor->consecutiveTxFailures + 1 : 255);
  if (neighbor->consecutiveTxFailures < 2) return;
  const uint32_t now = millis();
  for (auto& route : routes_) {
    if (!route.used) continue;
    if (std::memcmp(route.backupNextHopMac, item.mac, 6) == 0) {
      std::memset(route.backupNextHopMac, 0, 6);
      route.backupLearnedMs = 0;
    }
    if (std::memcmp(route.nextHopMac, item.mac, 6) == 0) {
      std::memset(route.nextHopMac, 0, 6);
      if (isRouteLegValid(route.backupNextHopMac, route.backupLearnedMs, now)) {
        promoteBackup(&route, now);
      } else {
        route = RouteEntry{};
        ++stats_.routeExpired;
      }
    }
  }
}

void EspNowMesh::processTxResultQueue() {
  if (txResultQueue_ == nullptr) return;
  TxResultItem item{};
  while (xQueueReceive(txResultQueue_, &item, 0) == pdTRUE) recordTxResult(item);
}

void EspNowMesh::processRxQueue() {
  if (rxQueue_ == nullptr) {
    return;
  }

  RxQueueItem item{};
  uint8_t processed = 0;
  while (processed < kRxProcessBudgetPerLoop && xQueueReceive(rxQueue_, &item, 0) == pdTRUE) {
    processFrame(item);
    processed++;
  }
}

void EspNowMesh::processFrame(const RxQueueItem& item) {
  stats_.rxFrames++;

  MeshFrameHeader header{};
  const uint8_t* body = nullptr;
  size_t bodyLen = 0;
  if (!parseHeader(item.data, item.len, &header, &body, &bodyLen)) {
    stats_.rxParseErrors++;
    return;
  }

  if (header.originId == nodeId_) {
    ++stats_.droppedDuplicates;
    return;
  }
  if (!validMeshBody(header.type, body, bodyLen)) {
    ++stats_.rxParseErrors;
    return;
  }
  const uint32_t nowMs = millis();
  pruneRoutingTables(nowMs);

  DuplicateKey dedupKey{};
  dedupKey.originId = header.originId;
  dedupKey.messageId = header.messageId;
  dedupKey.frameType = header.type;
  dedupKey.fragmentIndex = 0xFF;
  if (header.type == static_cast<uint8_t>(FrameType::Fragment)) {
    if (bodyLen < sizeof(FragmentMeta)) {
      stats_.rxParseErrors++;
      return;
    }
    FragmentMeta fragmentMeta{};
    std::memcpy(&fragmentMeta, body, sizeof(fragmentMeta));
    dedupKey.fragmentIndex = fragmentMeta.fragIndex;
  } else if (header.type == static_cast<uint8_t>(FrameType::RoutedFragment)) {
    if (bodyLen < (sizeof(RoutedFragmentMeta) + sizeof(FragmentMeta))) {
      stats_.rxParseErrors++;
      return;
    }
    FragmentMeta fragmentMeta{};
    std::memcpy(&fragmentMeta, body + sizeof(RoutedFragmentMeta), sizeof(fragmentMeta));
    dedupKey.fragmentIndex = fragmentMeta.fragIndex;
  }

  if (duplicateFilter_.seen(dedupKey, nowMs, kDuplicateWindowMs)) {
    // Learn from alternate duplicate arrivals before dropping them so backup routes
    // can still improve even when the first copy already won dedup.
    learnRouteFromFrame(header.originId, item.senderMac, header.hops, item.rssi, nowMs);
    stats_.droppedDuplicates++;
    return;
  }
  if (parseRejectFilter_.seen(dedupKey, nowMs, kParseRejectDuplicateWindowMs)) {
    stats_.droppedDuplicates++;
    return;
  }

  NodeRecord* originNode = nullptr;
  if (upsertNode(header.originId, &originNode) && originNode != nullptr) {
    originNode->lastSeenMs = nowMs;
    originNode->lastRssi = item.rssi;
  }

  bool parsedAndAccepted = false;
  bool routedFrame = false;
  RoutedFragmentMeta routedMeta{};
  if (header.type == static_cast<uint8_t>(FrameType::Fragment)) {
    parsedAndAccepted = handleFragmentFrame(header, body, bodyLen, item.rssi, item.senderMac, nowMs);
  } else if (header.type == static_cast<uint8_t>(FrameType::RoutedFragment)) {
    routedFrame = true;
    parsedAndAccepted =
        handleRoutedFragmentFrame(header, body, bodyLen, item.rssi, item.senderMac, nowMs, &routedMeta);
  } else if (header.type == static_cast<uint8_t>(FrameType::NodeInfo)) {
    parsedAndAccepted = handleNodeInfoFrame(header, body, bodyLen, item.rssi, nowMs);
  } else {
    stats_.rxParseErrors++;
    return;
  }

  if (!parsedAndAccepted) {
    parseRejectFilter_.remember(dedupKey, nowMs);
    return;
  }
  duplicateFilter_.remember(dedupKey, nowMs);
  learnRouteFromFrame(header.originId, item.senderMac, header.hops, item.rssi, nowMs);

  const bool terminalRoutedToSelf = routedFrame && routedMeta.dstNodeId == nodeId_;
  if (header.ttl <= 1) {
    if (!terminalRoutedToSelf) {
      stats_.droppedTtl++;
    }
    return;
  }

  if (terminalRoutedToSelf) {
    return;
  }

  if (item.len > kEspNowMaxPayload) {
    return;
  }

  uint8_t forwardBuffer[kEspNowMaxPayload];
  std::memcpy(forwardBuffer, item.data, item.len);
  MeshFrameHeader forwardHeader{};
  std::memcpy(&forwardHeader, forwardBuffer, sizeof(forwardHeader));
  forwardHeader.ttl = static_cast<uint8_t>(forwardHeader.ttl - 1);
  if (forwardHeader.hops < 0xFF) {
    forwardHeader.hops = static_cast<uint8_t>(forwardHeader.hops + 1);
  }
  std::memcpy(forwardBuffer, &forwardHeader, sizeof(forwardHeader));

  uint8_t attempts = 1;
  if (header.type == static_cast<uint8_t>(FrameType::NodeInfo)) {
    attempts = kForwardSendAttemptsNodeInfo;
  } else {
    attempts = kForwardSendAttemptsFragment;
  }
  attempts = adaptiveAttemptBudget(attempts);

  bool forwarded = false;
  if (routedFrame && routedMeta.dstNodeId != 0 && routedMeta.dstNodeId != nodeId_ && LPWA_ROUTING_MODE >= 2) {
    RouteEntry route{};
    if (selectRoute(routedMeta.dstNodeId, &route) &&
        std::memcmp(route.nextHopMac, item.senderMac, 6) != 0) {
      stats_.routeLookupHit++;
      for (uint8_t attempt = 0; attempt < attempts; ++attempt) {
        if (attempt > 0 && !selectRoute(routedMeta.dstNodeId, &route)) break;
        if (std::memcmp(route.nextHopMac, item.senderMac, 6) == 0) break;
        stats_.routedUnicastAttempts++;
        if (sendRawUnicast(route.nextHopMac, forwardBuffer, item.len)) {
          stats_.routedUnicastSuccess++;
          forwarded = true;
          break;
        }
        stats_.routedUnicastFail++;
        if ((attempt + 1) < attempts) {
          cooperativeDelay(kForwardJitterMinMs, kForwardJitterMaxMs);
        }
      }
    } else {
      stats_.routeLookupMiss++;
    }
    if (!forwarded) {
      stats_.routedFallbackFlood++;
    }
  }

  if (!forwarded && !(routedFrame && routedMeta.dstNodeId == nodeId_)) {
    delay(randomDelayMs(kForwardJitterMinMs, kForwardJitterMaxMs));
    for (uint8_t attempt = 0; attempt < attempts; ++attempt) {
      if (sendRawBroadcast(forwardBuffer, item.len)) {
        forwarded = true;
        break;
      }
      if ((attempt + 1) < attempts) {
        cooperativeDelay(kForwardJitterMinMs, kForwardJitterMaxMs);
      }
    }
  }

  if (forwarded) {
    stats_.forwardedFrames++;
  }
}

bool EspNowMesh::parseHeader(const uint8_t* data, size_t len, MeshFrameHeader* outHeader,
                             const uint8_t** outBody, size_t* outBodyLen) const {
  if (data == nullptr || outHeader == nullptr || outBody == nullptr || outBodyLen == nullptr) {
    return false;
  }
  if (len < sizeof(MeshFrameHeader)) {
    return false;
  }

  std::memcpy(outHeader, data, sizeof(MeshFrameHeader));
  if (outHeader->magic != kMeshMagic || outHeader->version != kMeshVersion) {
    return false;
  }
  if (outHeader->type != static_cast<uint8_t>(FrameType::Fragment) &&
      outHeader->type != static_cast<uint8_t>(FrameType::NodeInfo) &&
      outHeader->type != static_cast<uint8_t>(FrameType::RoutedFragment)) {
    return false;
  }

  if (!validMeshEnvelope(outHeader->originId, outHeader->ttl, outHeader->hops)) return false;
  *outBody = data + sizeof(MeshFrameHeader);
  *outBodyLen = len - sizeof(MeshFrameHeader);
  return true;
}

