Aero123421/ESP32C3Meshtest/src/espnow_mesh.cpp
bool EspNowMesh::handleFragmentFrame(const MeshFrameHeader& header, const uint8_t* body, size_t bodyLen,
                                     int8_t rssi, const uint8_t* senderMac, uint32_t nowMs) {
  if (body == nullptr || bodyLen < sizeof(FragmentMeta)) {
    stats_.rxParseErrors++;
    return false;
  }

  FragmentMeta fragmentMeta{};
  std::memcpy(&fragmentMeta, body, sizeof(FragmentMeta));
  const uint8_t* chunk = body + sizeof(FragmentMeta);
  const size_t chunkLen = bodyLen - sizeof(FragmentMeta);

  if (fragmentMeta.appType != static_cast<uint8_t>(AppPayloadType::Text) &&
      fragmentMeta.appType != static_cast<uint8_t>(AppPayloadType::Binary)) {
    stats_.rxParseErrors++;
    return false;
  }
  if (chunkLen != fragmentMeta.chunkLen) {
    stats_.rxParseErrors++;
    return false;
  }

  ReassembledMessage completed{};
  const bool done = reassembly_.PushFragment(
      header.originId, header.messageId, static_cast<AppPayloadType>(fragmentMeta.appType), header.hops,
      fragmentMeta.fragIndex, fragmentMeta.fragCount, fragmentMeta.totalLen, chunk, fragmentMeta.chunkLen,
      rssi, senderMac, nowMs, &completed);
  if (!done) {
    return true;
  }

  if (queueInbound(completed)) {
    stats_.reassemblyCompleted++;
  } else {
    stats_.rxQueueDropped++;
  }
  return true;
}

bool EspNowMesh::handleRoutedFragmentFrame(const MeshFrameHeader& header, const uint8_t* body, size_t bodyLen,
                                           int8_t rssi, const uint8_t* senderMac, uint32_t nowMs,
                                           RoutedFragmentMeta* outRouteMeta) {
  if (body == nullptr || bodyLen < (sizeof(RoutedFragmentMeta) + sizeof(FragmentMeta))) {
    stats_.rxParseErrors++;
    return false;
  }

  RoutedFragmentMeta routeMeta{};
  std::memcpy(&routeMeta, body, sizeof(routeMeta));
  if (outRouteMeta != nullptr) {
    *outRouteMeta = routeMeta;
  }

  FragmentMeta fragmentMeta{};
  std::memcpy(&fragmentMeta, body + sizeof(RoutedFragmentMeta), sizeof(fragmentMeta));
  if (fragmentMeta.fragCount == 0 || fragmentMeta.fragIndex >= fragmentMeta.fragCount) {
    stats_.rxParseErrors++;
    return false;
  }
  const size_t expectedBodyLen =
      sizeof(RoutedFragmentMeta) + sizeof(FragmentMeta) + static_cast<size_t>(fragmentMeta.chunkLen);
  if (expectedBodyLen != bodyLen) {
    stats_.rxParseErrors++;
    return false;
  }
  if (fragmentMeta.totalLen > kMaxAppPayload) {
    stats_.rxParseErrors++;
    return false;
  }

  if (routeMeta.dstNodeId != 0 && routeMeta.dstNodeId != nodeId_) {
    // relay-only path
    return true;
  }
  return handleFragmentFrame(header, body + sizeof(RoutedFragmentMeta),
                             bodyLen - sizeof(RoutedFragmentMeta), rssi, senderMac, nowMs);
}

bool EspNowMesh::handleNodeInfoFrame(const MeshFrameHeader& header, const uint8_t* body, size_t bodyLen,
                                     int8_t rssi, uint32_t nowMs) {
  constexpr size_t kLegacyNodeInfoPayloadSize = 22;
  if (body == nullptr || bodyLen < kLegacyNodeInfoPayloadSize) {
    stats_.rxParseErrors++;
    return false;
  }

  NodeInfoPayload remote{};
  if (bodyLen >= sizeof(remote)) {
    std::memcpy(&remote, body, sizeof(remote));
  } else {
    std::memcpy(&remote.nodeId, body + 0, sizeof(remote.nodeId));
    std::memcpy(&remote.uptimeSec, body + 4, sizeof(remote.uptimeSec));
    std::memcpy(&remote.freeHeap, body + 8, sizeof(remote.freeHeap));
    std::memcpy(&remote.rxFrames, body + 12, sizeof(remote.rxFrames));
    std::memcpy(&remote.txFrames, body + 16, sizeof(remote.txFrames));
    std::memcpy(&remote.seenNodes, body + 20, sizeof(remote.seenNodes));
    std::memset(remote.staMac, 0, sizeof(remote.staMac));
  }
  if (remote.nodeId == 0 || remote.nodeId != header.originId) {
    stats_.rxParseErrors++;
    return false;
  }

  NodeRecord* node = nullptr;
  if (!upsertNode(remote.nodeId, &node) || node == nullptr) {
    return false;
  }

  node->lastSeenMs = nowMs;
  node->lastRssi = rssi;
  node->hasMac = false;
  for (size_t i = 0; i < sizeof(remote.staMac); ++i) {
    if (remote.staMac[i] != 0) {
      node->hasMac = true;
      break;
    }
  }
  if (node->hasMac) {
    std::memcpy(node->staMac, remote.staMac, sizeof(node->staMac));
  } else {
    std::memset(node->staMac, 0, sizeof(node->staMac));
  }
  node->uptimeSec = remote.uptimeSec;
  node->freeHeap = remote.freeHeap;
  node->remoteRxFrames = remote.rxFrames;
  node->remoteTxFrames = remote.txFrames;
  stats_.nodeInfoReceived++;
  return true;
}

bool EspNowMesh::sendPayload(AppPayloadType payloadType, const uint8_t* payload, size_t len, uint8_t ttl,
                             uint32_t* outMessageId) {
  if (len > kMaxAppPayload) {
    return false;
  }
  if (len > 0 && payload == nullptr) {
    return false;
  }
  ttl = clampTtl(ttl);

  const uint8_t fragmentCount = Fragmenter::CalculateFragmentCount(len);
  if (fragmentCount == 0) {
    return false;
  }

  const uint32_t messageId = nextMessageId();
  for (uint8_t index = 0; index < fragmentCount; ++index) {
    const uint8_t* chunkPtr = nullptr;
    uint16_t chunkLen = 0;
    if (!Fragmenter::GetFragmentSlice(payload, len, index, &chunkPtr, &chunkLen)) {
      return false;
    }

    MeshFrameHeader header{};
    header.magic = kMeshMagic;
    header.version = kMeshVersion;
    header.type = static_cast<uint8_t>(FrameType::Fragment);
    header.originId = nodeId_;
    header.messageId = messageId;
    header.ttl = ttl;
    header.hops = 0;

    FragmentMeta fragmentMeta{};
    fragmentMeta.appType = static_cast<uint8_t>(payloadType);
    fragmentMeta.fragIndex = index;
    fragmentMeta.fragCount = fragmentCount;
    fragmentMeta.totalLen = static_cast<uint16_t>(len);
    fragmentMeta.chunkLen = chunkLen;

    const size_t frameLen = sizeof(MeshFrameHeader) + sizeof(FragmentMeta) + chunkLen;
    if (frameLen > kEspNowMaxPayload) {
      return false;
    }

    uint8_t frame[kEspNowMaxPayload];
    std::memcpy(frame, &header, sizeof(header));
    std::memcpy(frame + sizeof(header), &fragmentMeta, sizeof(fragmentMeta));
    if (chunkLen > 0) {
      std::memcpy(frame + sizeof(header) + sizeof(fragmentMeta), chunkPtr, chunkLen);
    }

    DuplicateKey localFrameKey{};
    localFrameKey.originId = nodeId_;
    localFrameKey.messageId = messageId;
    localFrameKey.frameType = static_cast<uint8_t>(FrameType::Fragment);
    localFrameKey.fragmentIndex = index;
    duplicateFilter_.seenAndRemember(localFrameKey, millis(), kDuplicateWindowMs);

    bool sentAny = false;
    const uint8_t attemptBudget = adaptiveAttemptBudget(kOriginFrameRepeatCount);
    for (uint8_t attempt = 0; attempt < attemptBudget; ++attempt) {
      if (sendRawBroadcast(frame, frameLen)) {
        sentAny = true;
      }
      if ((attempt + 1) < attemptBudget) {
        cooperativeDelay(kOriginFrameRepeatGapMinMs, kOriginFrameRepeatGapMaxMs);
      }
    }
    if (!sentAny) {
      return false;
    }
    if ((index + 1) < fragmentCount) {
      cooperativeDelay(kInterFragmentGapMinMs, kInterFragmentGapMaxMs);
    }
  }

  if (outMessageId != nullptr) {
    *outMessageId = messageId;
  }
  return true;
}

