Aero123421/ESP32C3Meshtest/src/espnow_mesh.cpp
bool EspNowMesh::sendPayloadDirected(AppPayloadType payloadType, const uint8_t* payload, size_t len,
                                     uint32_t dstNodeId, uint8_t ttl, uint32_t* outMessageId) {
  if (dstNodeId == 0 || dstNodeId == nodeId_) {
    return false;
  }
  if (LPWA_ROUTING_MODE <= 0) {
    return sendPayload(payloadType, payload, len, ttl, outMessageId);
  }
  if (len > kMaxAppPayload) {
    return false;
  }
  if (len > 0 && payload == nullptr) {
    return false;
  }
  ttl = clampTtl(ttl);

  const uint8_t fragmentCount = Fragmenter::CalculateFragmentCount(len);
  if (fragmentCount == 0) {
    return false;
  }

  const uint32_t messageId = nextMessageId();
  for (uint8_t index = 0; index < fragmentCount; ++index) {
    const uint8_t* chunkPtr = nullptr;
    uint16_t chunkLen = 0;
    if (!Fragmenter::GetFragmentSlice(payload, len, index, &chunkPtr, &chunkLen)) {
      return false;
    }

    MeshFrameHeader header{};
    header.magic = kMeshMagic;
    header.version = kMeshVersion;
    header.type = static_cast<uint8_t>(FrameType::RoutedFragment);
    header.originId = nodeId_;
    header.messageId = messageId;
    header.ttl = ttl;
    header.hops = 0;

    RoutedFragmentMeta routeMeta{};
    routeMeta.dstNodeId = dstNodeId;

    FragmentMeta fragmentMeta{};
    fragmentMeta.appType = static_cast<uint8_t>(payloadType);
    fragmentMeta.fragIndex = index;
    fragmentMeta.fragCount = fragmentCount;
    fragmentMeta.totalLen = static_cast<uint16_t>(len);
    fragmentMeta.chunkLen = chunkLen;

    const size_t frameLen = sizeof(MeshFrameHeader) + sizeof(RoutedFragmentMeta) + sizeof(FragmentMeta) + chunkLen;
    if (frameLen > kEspNowMaxPayload) {
      return false;
    }

    uint8_t frame[kEspNowMaxPayload];
    uint8_t* ptr = frame;
    std::memcpy(ptr, &header, sizeof(header));
    ptr += sizeof(header);
    std::memcpy(ptr, &routeMeta, sizeof(routeMeta));
    ptr += sizeof(routeMeta);
    std::memcpy(ptr, &fragmentMeta, sizeof(fragmentMeta));
    ptr += sizeof(fragmentMeta);
    if (chunkLen > 0) {
      std::memcpy(ptr, chunkPtr, chunkLen);
    }

    DuplicateKey localFrameKey{};
    localFrameKey.originId = nodeId_;
    localFrameKey.messageId = messageId;
    localFrameKey.frameType = static_cast<uint8_t>(FrameType::RoutedFragment);
    localFrameKey.fragmentIndex = index;
    duplicateFilter_.seenAndRemember(localFrameKey, millis(), kDuplicateWindowMs);

    bool sentAny = false;
    bool hadRoute = false;
    const uint8_t unicastAttempts = adaptiveAttemptBudget(kDirectedOriginAttemptCount);
    for (uint8_t attempt = 0; attempt < unicastAttempts; ++attempt) {
      RouteEntry route{};
      if (!selectRoute(dstNodeId, &route)) {
        break;
      }
      hadRoute = true;
      stats_.routedUnicastAttempts++;
      if (sendRawUnicast(route.nextHopMac, frame, frameLen)) {
        stats_.routedUnicastSuccess++;
        sentAny = true;
        break;
      }
      stats_.routedUnicastFail++;
      if ((attempt + 1) < unicastAttempts) {
        cooperativeDelay(kOriginFrameRepeatGapMinMs, kOriginFrameRepeatGapMaxMs);
      }
    }
    if (hadRoute) {
      stats_.routeLookupHit++;
    } else {
      stats_.routeLookupMiss++;
    }
    if (!sentAny) {
      stats_.routedFallbackFlood++;
      const uint8_t floodAttempts = adaptiveAttemptBudget(kDirectedFallbackFloodAttempts);
      for (uint8_t attempt = 0; attempt < floodAttempts; ++attempt) {
        if (sendRawBroadcast(frame, frameLen)) {
          sentAny = true;
          break;
        }
        if ((attempt + 1) < floodAttempts) {
          cooperativeDelay(kOriginFrameRepeatGapMinMs, kOriginFrameRepeatGapMaxMs);
        }
      }
    }
    if (!sentAny) {
      return false;
    }
    if ((index + 1) < fragmentCount) {
      cooperativeDelay(kInterFragmentGapMinMs, kInterFragmentGapMaxMs);
    }
  }

  if (outMessageId != nullptr) {
    *outMessageId = messageId;
  }
  return true;
}

bool EspNowMesh::sendNodeInfo(uint8_t ttl) {
  ttl = clampTtl(ttl);

  MeshFrameHeader header{};
  header.magic = kMeshMagic;
  header.version = kMeshVersion;
  header.type = static_cast<uint8_t>(FrameType::NodeInfo);
  header.originId = nodeId_;
  header.messageId = nextMessageId();
  header.ttl = ttl;
  header.hops = 0;

  NodeInfoPayload info{};
  info.nodeId = nodeId_;
  info.uptimeSec = millis() / 1000UL;
  info.freeHeap = ESP.getFreeHeap();
  info.rxFrames = stats_.rxFrames;
  info.txFrames = stats_.txFrames;
  info.seenNodes = nodeCount_;
  if (hasStaMac_) {
    std::memcpy(info.staMac, staMac_, sizeof(info.staMac));
  } else {
    std::memset(info.staMac, 0, sizeof(info.staMac));
  }

  NodeRecord* selfNode = findNode(nodeId_);
  if (selfNode != nullptr) {
    selfNode->lastSeenMs = millis();
    selfNode->hasMac = hasStaMac_;
    if (hasStaMac_) {
      std::memcpy(selfNode->staMac, staMac_, sizeof(selfNode->staMac));
    }
    selfNode->uptimeSec = info.uptimeSec;
    selfNode->freeHeap = info.freeHeap;
    selfNode->remoteRxFrames = info.rxFrames;
    selfNode->remoteTxFrames = info.txFrames;
  }

  const size_t frameLen = sizeof(MeshFrameHeader) + sizeof(NodeInfoPayload);
  uint8_t frame[kEspNowMaxPayload];
  std::memcpy(frame, &header, sizeof(header));
  std::memcpy(frame + sizeof(header), &info, sizeof(info));

  DuplicateKey localFrameKey{};
  localFrameKey.originId = nodeId_;
  localFrameKey.messageId = header.messageId;
  localFrameKey.frameType = static_cast<uint8_t>(FrameType::NodeInfo);
  localFrameKey.fragmentIndex = 0xFF;
  duplicateFilter_.seenAndRemember(localFrameKey, millis(), kDuplicateWindowMs);

  if (!sendRawBroadcast(frame, frameLen)) {
    return false;
  }
  stats_.nodeInfoSent++;
  return true;
}

bool EspNowMesh::sendRawBroadcast(const uint8_t* data, size_t len) {
  return sendRawTo(kBroadcastMac, data, len);
}

bool EspNowMesh::sendRawUnicast(const uint8_t* mac, const uint8_t* data, size_t len) {
  if (mac == nullptr) {
    return false;
  }
  if (!ensurePeerForMac(mac)) {
    return false;
  }
  return sendRawTo(mac, data, len);
}

bool EspNowMesh::sendRawTo(const uint8_t* mac, const uint8_t* data, size_t len) {
  if (!ready_ || mac == nullptr || data == nullptr || len == 0 || len > kEspNowMaxPayload) return false;
  processTxResultQueue();  // drain a late callback before allowing another TX
  if (txAwaiting_) return false;
  const uint8_t maxAttempts = static_cast<uint8_t>(kSendRawNoMemRetries + 1U);
  for (uint8_t attempt = 0; attempt < maxAttempts; ++attempt) {
    txAwaiting_ = true;
    txStartedMs_ = millis();
    const esp_err_t result = esp_now_send(mac, data, len);
    if (result == ESP_OK) {
      ++stats_.txFrames;
      TxResultItem item{};
      // Do NOT pump RX here: forwarding could recursively submit a second TX.
      // Only one frame is outstanding, so callback status identifies this frame.
      if (xQueueReceive(txResultQueue_, &item, pdMS_TO_TICKS(1000)) == pdTRUE) {
        recordTxResult(item);
        return item.success;
      }
      ++txCallbackTimeouts_;
      return false;  // remain quarantined until late callback or stall restart
    }
    txAwaiting_ = false;
    if (result != ESP_ERR_ESPNOW_NO_MEM || attempt + 1 >= maxAttempts) {
      if (result == ESP_ERR_ESPNOW_NO_MEM) ++stats_.txNoMemDrops;
      ++stats_.txFailed;
      return false;
    }
    ++stats_.txNoMemRetries;
    delay(randomDelayMs(kSendRawNoMemBackoffMinMs, kSendRawNoMemBackoffMaxMs));
  }
  return false;
}

uint8_t EspNowMesh::clampTtl(uint8_t ttl) const {
  if (ttl == 0) {
    ttl = 1;
  }
  if (ttl > kMaxTtl) {
    ttl = kMaxTtl;
  }
  return ttl;
}

uint32_t EspNowMesh::clampNodeInfoPeriodMs(uint32_t periodMs) const {
  uint32_t v = periodMs;
  if (v < kNodeInfoPeriodMinMs) {
    v = kNodeInfoPeriodMinMs;
  }
  if (v > kNodeInfoPeriodMaxMs) {
    v = kNodeInfoPeriodMaxMs;
  }
  return v;
}

uint8_t EspNowMesh::adaptiveAttemptBudget(uint8_t baseAttempts) const {
  uint8_t attempts = (baseAttempts == 0) ? 1 : baseAttempts;
  uint16_t queued = 0;
  if (rxQueue_ != nullptr) {
    queued = static_cast<uint16_t>(uxQueueMessagesWaiting(rxQueue_));
  }
  if (queued >= kAdaptiveQueueHighWater && attempts > 1) {
    attempts = static_cast<uint8_t>(attempts - 1);

