Aero123421/ESP32C3Meshtest/src/espnow_mesh.cpp
  }
  if (attempts == 0) {
    attempts = 1;
  }
  return attempts;
}

bool EspNowMesh::isZeroMac(const uint8_t* mac) const {
  if (mac == nullptr) {
    return true;
  }
  const uint8_t zeroMac[6] = {0, 0, 0, 0, 0, 0};
  return std::memcmp(mac, zeroMac, 6) == 0;
}

bool EspNowMesh::isRouteLegValid(const uint8_t* nextHopMac, uint32_t learnedMs, uint32_t nowMs) const {
  if (isZeroMac(nextHopMac)) {
    return false;
  }
  if ((nowMs - learnedMs) > kRouteExpireMs) {
    return false;
  }
  return true;
}

void EspNowMesh::promoteBackup(RouteEntry* route, uint32_t nowMs) {
  if (route == nullptr) {
    return;
  }
  if (!isRouteLegValid(route->backupNextHopMac, route->backupLearnedMs, nowMs)) {
    return;
  }
  std::memcpy(route->nextHopMac, route->backupNextHopMac, sizeof(route->nextHopMac));
  route->nextHopNodeId = route->backupNextHopNodeId;
  route->hops = route->backupHops;
  route->metricQ8 = route->backupMetricQ8;
  route->learnedMs = route->backupLearnedMs;

  std::memset(route->backupNextHopMac, 0, sizeof(route->backupNextHopMac));
  route->backupNextHopNodeId = 0;
  route->backupHops = 0;
  route->backupMetricQ8 = 0;
  route->backupLearnedMs = 0;
  stats_.routePromoted++;
}

void EspNowMesh::cooperativeDelay(uint16_t minMs, uint16_t maxMs) {
  const uint16_t waitMs = randomDelayMs(minMs, maxMs);
  if (waitMs == 0) {
    return;
  }
  const bool pumpRxQueue = !inCooperativeDelay_;
  if (pumpRxQueue) {
    inCooperativeDelay_ = true;
  }
  const uint32_t started = millis();
  while ((millis() - started) < waitMs) {
    if (pumpRxQueue) {
      processRxQueue();
    }
    delay(1);
  }
  if (pumpRxQueue) {
    inCooperativeDelay_ = false;
  }
}

void EspNowMesh::updateNeighborTxEtx(NeighborEntry* neighbor, bool success) {
  if (neighbor == nullptr) {
    return;
  }
  if (success) {
    if (neighbor->txOk < 0xFFFFU) {
      neighbor->txOk++;
    }
  } else {
    if (neighbor->txFail < 0xFFFFU) {
      neighbor->txFail++;
    }
  }
  const uint32_t total = static_cast<uint32_t>(neighbor->txOk) + static_cast<uint32_t>(neighbor->txFail);
  if (total > 320U) {
    neighbor->txOk = static_cast<uint16_t>(neighbor->txOk / 2U);
    neighbor->txFail = static_cast<uint16_t>(neighbor->txFail / 2U);
  }
  const uint16_t ok = (neighbor->txOk == 0) ? 1 : neighbor->txOk;
  const uint16_t fail = neighbor->txFail;
  uint32_t sampleQ8 = ((static_cast<uint32_t>(ok) + static_cast<uint32_t>(fail)) * 256U) / ok;
  if (sampleQ8 < 256U) {
    sampleQ8 = 256U;
  } else if (sampleQ8 > 2048U) {
    sampleQ8 = 2048U;
  }
  if (neighbor->etxQ8 == 0) {
    neighbor->etxQ8 = static_cast<uint16_t>(sampleQ8);
  } else {
    neighbor->etxQ8 = static_cast<uint16_t>(
        (static_cast<uint32_t>(neighbor->etxQ8) * 7U + sampleQ8 + 4U) / 8U);
  }
}

bool EspNowMesh::ensurePeerForMac(const uint8_t* mac) {
  if (mac == nullptr) {
    return false;
  }
  if (std::memcmp(mac, kBroadcastMac, 6) == 0) {
    return true;
  }
  if (esp_now_is_peer_exist(mac)) {
    return true;
  }
  esp_now_peer_info_t peerInfo{};
  std::memcpy(peerInfo.peer_addr, mac, 6);
  peerInfo.channel = kMeshChannel;
  peerInfo.encrypt = false;
  peerInfo.ifidx = WIFI_IF_STA;
  const esp_err_t add = esp_now_add_peer(&peerInfo);
  return add == ESP_OK || add == ESP_ERR_ESPNOW_EXIST;
}

void EspNowMesh::pruneRoutingTables(uint32_t nowMs) {
  for (size_t i = 0; i < kMaxNeighborNodes; ++i) {
    NeighborEntry& n = neighbors_[i];
    if (!n.used) {
      continue;
    }
    if ((nowMs - n.lastSeenMs) > kNeighborExpireMs) {
      (void)esp_now_del_peer(n.mac);
      n = NeighborEntry{};
    }
  }
  for (size_t i = 0; i < kMaxRouteEntries; ++i) {
    RouteEntry& r = routes_[i];
    if (!r.used) {
      continue;
    }
    const bool primaryValid = isRouteLegValid(r.nextHopMac, r.learnedMs, nowMs);
    const bool backupValid = isRouteLegValid(r.backupNextHopMac, r.backupLearnedMs, nowMs);
    if (!primaryValid && backupValid) {
      promoteBackup(&r, nowMs);
    }
    if (!primaryValid && !backupValid) {
      r = RouteEntry{};
      stats_.routeExpired++;
      continue;
    }
    if (!backupValid) {
      std::memset(r.backupNextHopMac, 0, sizeof(r.backupNextHopMac));
      r.backupNextHopNodeId = 0;
      r.backupHops = 0;
      r.backupMetricQ8 = 0;
      r.backupLearnedMs = 0;
    }
  }
}

void EspNowMesh::learnRouteFromFrame(uint32_t originId, const uint8_t* senderMac, uint8_t hops, int8_t rssi,
                                     uint32_t nowMs) {
  if (originId == 0 || originId == nodeId_ || senderMac == nullptr) {
    return;
  }

  NeighborEntry* neighbor = upsertNeighbor(senderMac);
  if (neighbor == nullptr) {
    return;
  }
  neighbor->lastSeenMs = nowMs;
  // Arduino 2 / IDF 4 callbacks have no RSSI: zero is unknown, NOT 0 dBm.
  if (rssi == 0) rssi = -85;
  const int16_t sampleQ8 = static_cast<int16_t>(static_cast<int16_t>(rssi) * 256);
  if (neighbor->rssiEwmaQ8 == 0) {
    neighbor->rssiEwmaQ8 = sampleQ8;
  } else {
    neighbor->rssiEwmaQ8 =
        static_cast<int16_t>((static_cast<int32_t>(neighbor->rssiEwmaQ8) * 7 + sampleQ8 + 4) / 8);
  }

  const uint8_t routeHops = (hops >= 0xFE) ? 0xFF : static_cast<uint8_t>(hops + 1);
  const uint16_t metricQ8 = computeRouteMetricQ8(neighbor, routeHops, rssi);
  RouteEntry* route = upsertRoute(originId);
  if (route == nullptr) {
    return;
  }

  uint32_t nextHopNodeId = 0;
  (void)resolveNodeIdByMac(senderMac, &nextHopNodeId);
  const bool empty = !route->used || route->dstNodeId == 0 || !isRouteLegValid(route->nextHopMac, route->learnedMs, nowMs);

  bool changed = false;
  const bool samePrimary = std::memcmp(route->nextHopMac, senderMac, 6) == 0;
  if (empty || samePrimary) {
    changed = empty || route->hops != routeHops || route->metricQ8 != metricQ8 ||
              route->nextHopNodeId != nextHopNodeId;
    route->used = true;
    route->dstNodeId = originId;
    std::memcpy(route->nextHopMac, senderMac, 6);
    route->learnedMs = nowMs;
    route->hops = routeHops;
    route->metricQ8 = metricQ8;
    route->nextHopNodeId = nextHopNodeId;
  } else {
    const uint32_t currentMetric = route->metricQ8;
    const bool primaryBetter = (metricQ8 + kRouteHysteresisQ8) < currentMetric;
    if (primaryBetter) {
      const bool backupPresent = !isZeroMac(route->nextHopMac);
      if (backupPresent) {
        std::memcpy(route->backupNextHopMac, route->nextHopMac, sizeof(route->backupNextHopMac));
        route->backupNextHopNodeId = route->nextHopNodeId;
        route->backupHops = route->hops;
        route->backupMetricQ8 = route->metricQ8;
        route->backupLearnedMs = route->learnedMs;
      }
      route->used = true;
      route->dstNodeId = originId;
      std::memcpy(route->nextHopMac, senderMac, 6);
      route->nextHopNodeId = nextHopNodeId;
      route->hops = routeHops;
      route->metricQ8 = metricQ8;
      route->learnedMs = nowMs;
      changed = true;
    } else {
      const bool sameBackup = std::memcmp(route->backupNextHopMac, senderMac, 6) == 0;
      const bool hasBackup = isRouteLegValid(route->backupNextHopMac, route->backupLearnedMs, nowMs);
      if (sameBackup || !hasBackup || (metricQ8 + kRouteHysteresisQ8) < route->backupMetricQ8) {
        changed = sameBackup || !hasBackup || route->backupMetricQ8 != metricQ8 ||
                  route->backupHops != routeHops || route->backupNextHopNodeId != nextHopNodeId;
        std::memcpy(route->backupNextHopMac, senderMac, sizeof(route->backupNextHopMac));
        route->backupNextHopNodeId = nextHopNodeId;
        route->backupHops = routeHops;
        route->backupMetricQ8 = metricQ8;
        route->backupLearnedMs = nowMs;
      }
    }
  }
  if (changed) {
    stats_.routeLearned++;
  }
}

bool EspNowMesh::selectRoute(uint32_t dstNodeId, RouteEntry* outRoute) {
  if (outRoute != nullptr) {
    *outRoute = RouteEntry{};
  }
  if (dstNodeId == 0 || dstNodeId == nodeId_) {
    return false;
  }
  RouteEntry* route = findRoute(dstNodeId);
  if (route == nullptr || !route->used) {
    return false;
  }
  const uint32_t nowMs = millis();
  const bool primaryValid = isRouteLegValid(route->nextHopMac, route->learnedMs, nowMs);
  const bool backupValid = isRouteLegValid(route->backupNextHopMac, route->backupLearnedMs, nowMs);
  if (!primaryValid && backupValid) {
    promoteBackup(route, nowMs);
  }
  if (!primaryValid && !backupValid) {
    route->used = false;
    route->dstNodeId = 0;
    stats_.routeExpired++;
    return false;
  }
  if (!backupValid) {
    std::memset(route->backupNextHopMac, 0, sizeof(route->backupNextHopMac));
    route->backupNextHopNodeId = 0;
    route->backupHops = 0;
    route->backupMetricQ8 = 0;
    route->backupLearnedMs = 0;
  }
  if (outRoute != nullptr) {
    *outRoute = *route;
  }
  return true;
}

