Aero123421/ESP32C3Meshtest/src/espnow_mesh.cpp
bool EspNowMesh::lookupNodeMac(uint32_t nodeId, uint8_t* outMac) const {
  if (outMac != nullptr) {
    std::memset(outMac, 0, 6);
  }
  if (nodeId == 0) {
    return false;
  }
  for (size_t i = 0; i < nodeCount_; ++i) {
    if (nodes_[i].nodeId != nodeId || !nodes_[i].hasMac) {
      continue;
    }
    if (outMac != nullptr) {
      std::memcpy(outMac, nodes_[i].staMac, 6);
    }
    return true;
  }
  return false;
}

EspNowMesh::NeighborEntry* EspNowMesh::findNeighbor(const uint8_t* mac) {
  if (mac == nullptr) {
    return nullptr;
  }
  for (size_t i = 0; i < kMaxNeighborNodes; ++i) {
    if (!neighbors_[i].used) {
      continue;
    }
    if (std::memcmp(neighbors_[i].mac, mac, 6) == 0) {
      return &neighbors_[i];
    }
  }
  return nullptr;
}

EspNowMesh::NeighborEntry* EspNowMesh::upsertNeighbor(const uint8_t* mac) {
  if (mac == nullptr) {
    return nullptr;
  }
  NeighborEntry* existing = findNeighbor(mac);
  if (existing != nullptr) {
    return existing;
  }
  size_t target = kMaxNeighborNodes;
  uint32_t oldest = 0;
  const uint32_t nowMs = millis();
  for (size_t i = 0; i < kMaxNeighborNodes; ++i) {
    if (!neighbors_[i].used) {
      target = i;
      break;
    }
    const uint32_t age = nowMs - neighbors_[i].lastSeenMs;
    if (target == kMaxNeighborNodes || age > oldest) {
      oldest = age;
      target = i;
    }
  }
  if (target >= kMaxNeighborNodes) {
    return nullptr;
  }
  neighbors_[target] = NeighborEntry{};
  neighbors_[target].used = true;
  neighbors_[target].lastSeenMs = nowMs;
  neighbors_[target].etxQ8 = 256;
  std::memcpy(neighbors_[target].mac, mac, 6);
  return &neighbors_[target];
}

EspNowMesh::RouteEntry* EspNowMesh::findRoute(uint32_t dstNodeId) {
  for (size_t i = 0; i < kMaxRouteEntries; ++i) {
    if (!routes_[i].used) {
      continue;
    }
    if (routes_[i].dstNodeId == dstNodeId) {
      return &routes_[i];
    }
  }
  return nullptr;
}

EspNowMesh::RouteEntry* EspNowMesh::upsertRoute(uint32_t dstNodeId) {
  if (dstNodeId == 0 || dstNodeId == nodeId_) {
    return nullptr;
  }
  RouteEntry* existing = findRoute(dstNodeId);
  if (existing != nullptr) {
    return existing;
  }

  size_t target = kMaxRouteEntries;
  uint32_t oldest = 0;
  const uint32_t nowMs = millis();
  for (size_t i = 0; i < kMaxRouteEntries; ++i) {
    if (!routes_[i].used) {
      target = i;
      break;
    }
    const uint32_t age = nowMs - routes_[i].learnedMs;
    if (target == kMaxRouteEntries || age > oldest) {
      oldest = age;
      target = i;
    }
  }
  if (target >= kMaxRouteEntries) {
    return nullptr;
  }
  routes_[target] = RouteEntry{};
  routes_[target].used = true;
  routes_[target].dstNodeId = dstNodeId;
  routes_[target].learnedMs = nowMs;
  return &routes_[target];
}

uint16_t EspNowMesh::computeRouteMetricQ8(const NeighborEntry* neighbor, uint8_t hops, int8_t rssi) const {
  const uint16_t etxQ8 = (neighbor != nullptr) ? neighbor->etxQ8 : static_cast<uint16_t>(256);
  const uint32_t hopTerm = static_cast<uint32_t>(hops) * static_cast<uint32_t>(kMetricWeightHopQ8) * 8U;
  const uint32_t etxTerm = (static_cast<uint32_t>(etxQ8) * static_cast<uint32_t>(kMetricWeightEtxQ8)) / 16U;
  int16_t usedRssi = static_cast<int16_t>(rssi);
  if (neighbor != nullptr && neighbor->rssiEwmaQ8 != 0) {
    usedRssi = static_cast<int16_t>(neighbor->rssiEwmaQ8 / 256);
  }
  const int16_t rssiAbs = static_cast<int16_t>(-usedRssi);
  const uint32_t rssiTerm =
      (static_cast<uint32_t>((rssiAbs > 0) ? rssiAbs : 0) * static_cast<uint32_t>(kMetricWeightRssiQ8)) / 2U;
  const uint32_t total = hopTerm + etxTerm + rssiTerm;
  if (total > 0xFFFFU) {
    return 0xFFFFU;
  }
  return static_cast<uint16_t>(total);
}

bool EspNowMesh::parseNodeIdString(const char* nodeIdText, uint32_t* outNodeId) {
  if (outNodeId != nullptr) {
    *outNodeId = 0;
  }
  if (nodeIdText == nullptr || nodeIdText[0] == '\0') {
    return false;
  }
  char* endPtr = nullptr;
  const unsigned long parsed = std::strtoul(nodeIdText, &endPtr, 0);
  if (endPtr == nodeIdText || (endPtr != nullptr && *endPtr != '\0') || parsed == 0UL) {
    return false;
  }
  if (outNodeId != nullptr) {
    *outNodeId = static_cast<uint32_t>(parsed);
  }
  return true;
}

bool EspNowMesh::queueInbound(const ReassembledMessage& message) {
  if (inboundCount_ >= kInboundMessageQueueDepth) {
    return false;
  }
  inboundQueue_[inboundTail_] = message;
  inboundTail_ = (inboundTail_ + 1) % kInboundMessageQueueDepth;
  inboundCount_++;
  return true;
}

uint32_t EspNowMesh::nextMessageId() {
  const uint32_t id = nextMessageId_++;
  if (nextMessageId_ == 0) {
    nextMessageId_ = 1;
  }
  return id;
}

NodeRecord* EspNowMesh::findNode(uint32_t nodeId) {
  for (size_t i = 0; i < nodeCount_; ++i) {
    if (nodes_[i].nodeId == nodeId) {
      return &nodes_[i];
    }
  }
  return nullptr;
}

bool EspNowMesh::upsertNode(uint32_t nodeId, NodeRecord** outNode) {
  if (nodeId == 0) {
    if (outNode != nullptr) {
      *outNode = nullptr;
    }
    return false;
  }

  NodeRecord* existing = findNode(nodeId);
  if (existing != nullptr) {
    if (outNode != nullptr) {
      *outNode = existing;
    }
    return true;
  }

  size_t index = 0;
  if (nodeCount_ < kMaxKnownNodes) {
    index = nodeCount_;
    nodeCount_++;
  } else {
    uint32_t nowMs = millis();
    uint32_t oldestAge = 0;
    bool selected = false;
    for (size_t i = 0; i < kMaxKnownNodes; ++i) {
      if (nodes_[i].nodeId == nodeId_) {
        continue;
      }
      const uint32_t age = nowMs - nodes_[i].lastSeenMs;
      if (!selected || age > oldestAge) {
        selected = true;
        oldestAge = age;
        index = i;
      }
    }
    if (!selected) {
      index = 0;
    }
  }

  nodes_[index] = NodeRecord{};
  nodes_[index].nodeId = nodeId;
  nodes_[index].lastSeenMs = millis();

  if (outNode != nullptr) {
    *outNode = &nodes_[index];
  }
  return true;
}

}  // namespace lpwa
